YaroslavTrymbach/ChargeStation/Stm32/ChargeStationCentralCPU/Src/main.c
	if(success){
		
		//Check if someone connector is ready
		for(i = 0; i < CONFIGURATION_NUMBER_OF_CONNECTORS; i++){
			conn = &connector[i];
			if(conn->status == CHARGE_POINT_STATUS_PREPARING){
				startChargeTransaction(i, tagId);
				return;
			}
		}
	}
}

void processMessageFromNET(GeneralMessage *message){
	NetInputMessage netMessage;
	printf("Main task. Message from NET is got\n");
	char s[32];
	switch(message->messageId){
		case MESSAGE_NET_SERVER_ACCEPT:
			sprintf(s, "Station %s", message->param1 ? "ACCEPTED" : "REJECTED");
		  Indication_ShowMessage(s, NULL, 5000);
		
		  if(NET_is_station_accepted()){
				//When station is accepted. It is need to send charge point status to server
				netMessage.messageId = NET_INPUT_MESSAGE_SEND_CHARGE_POINT_STATUS;
				NET_sendInputMessage(&netMessage);
			}
			break;
		case MESSAGE_NET_AUTHORIZE:
			acceptAuth(message->param2, message->param1);
			break;
	}
}

void onChannelStatusChanged(int connIndex){
	ChargePointConnector *conn;
	NetInputMessage netMessage;
	conn = &connector[connIndex];
	
	//If connection with server is present it is need to send new status 
	if(NET_is_station_accepted()){
		netMessage.messageId = NET_INPUT_MESSAGE_SEND_CONNECTOR_STATUS;
		netMessage.param1 = 0;
		PACK_TO_PARAM_BYTE0(netMessage.param1, connIndex + 1);
		PACK_TO_PARAM_BYTE1(netMessage.param1, connector[connIndex].status);
		PACK_TO_PARAM_BYTE2(netMessage.param1, CHARGE_POINT_ERROR_CODE_NO_ERROR);
		NET_sendInputMessage(&netMessage);
	}
	
	switch(conn->status){
		case CHARGE_POINT_STATUS_AVAILABLE:
			conn->userTagId = -1;
      lastCheckedTagId = 0;		
			break;
		case CHARGE_POINT_STATUS_CHARGING:
			lastCheckedTagId = 0;
			break;
		case CHARGE_POINT_STATUS_SUSPENDED_EV:
			conn->isMeterValueRequest = true;
			break;
	}
	Indication_PrintChannel(connIndex);
}

void processMessageFromChannels(GeneralMessage *message){
	int connIndex;
	ChargePointConnector *conn;
	
	switch(message->messageId){
		case MESSAGE_CHANNEL_STATUS_CHANGED:
			connIndex = message->param1;
			onChannelStatusChanged(connIndex);
			break;
		case MESSAGE_CHANNEL_CHARGING_HALTED:
			connIndex = message->param1;
		  conn = &connector[connIndex];
		  conn->status = CHARGE_POINT_STATUS_FINISHING;
		  conn->isMeterValueRequest = true; //Need request meterValue for close transaction
		  conn->chargeTransaction.isActive = false;
		  onChannelStatusChanged(connIndex);
			break;
		case MESSAGE_CHANNEL_GET_METER_VALUE:
			connIndex = message->param1;
		  conn = &connector[connIndex];
		  if(conn->chargeTransaction.isActive){
				//Need update screen
				Indication_PrintChannel(connIndex);
			}
			else{
				if(!conn->chargeTransaction.isClosed){
					//CloseTransaction
					stopChargeTransaction(connIndex);
				}
			}
			break;
	}
}

void processMessageFromRFID(GeneralMessage *message){
	uint32_t cardId;
	char s[32];
	NetInputMessage netMessage;
	
	printf("Main task. Message from RFID is got\n");
	switch(message->messageId){
		case MESSAGE_RFID_FOUND_CARD:
			cardId = message->param1;
			printf("CardId 0x%.8X\n", cardId);
		
		  if(cardId != lastCheckedTagId){
				sprintf(s, "CardId 0x%.8X\n", cardId);
				Indication_ShowMessage("Card discovered", s, 5000);
				
				if(!checkChargeTransactionByTag(cardId)){
					netMessage.messageId = NET_INPUT_MESSAGE_AUTHORIZE;
					netMessage.param1 = cardId;
					NET_sendInputMessage(&netMessage);
				}
				
				lastCheckedTagId = cardId;
			}
			break;
		case MESSAGE_RFID_CONNECTION:
			if(message->param1){
				//Connected
				ChargePoint_setRFIDEnabled(true);
			}
			else{
				//Disconnected
				ChargePoint_setRFIDEnabled(false);
			}
			netMessage.messageId = NET_INPUT_MESSAGE_SEND_CHARGE_POINT_STATUS;
			NET_sendInputMessage(&netMessage);
			break;
	}
}

void processMessageFromSerialControl(GeneralMessage *message){
	printf("Main task. Message from SerialControl is got\n");
	ChargePointSetting* st;	
	switch(message->messageId){
		case MESSAGE_SER_CONTROL_SET_LOCAL_IP:
			NET_changeLocalIp();
			break;
		case MESSAGE_SER_CONTROL_SET_SERVER_HOST:
			st = Settings_get();
			NET_CONN_setRemoteHost(st->serverHost);
			break;
		case MESSAGE_SER_CONTROL_SET_SERVER_PORT:
			st = Settings_get();
			NET_CONN_setRemotePort(st->serverPort);
			break;
	}
}

void testSaveSetting(){
	printf("testSaveSetting\n");
	sprintf(settings->ChargePointId, "SaveCP_%.8X", generateRnd32());
	printf("New ChargePointID: %s\n", settings->ChargePointId);
	if(Settings_save())
		printf("Setting saving is success\n");
	else
		printf("Setting saving is failed\n");
}

void testReconnect(){
	NetInputMessage mes;
	mes.messageId = NET_INPUT_MESSAGE_RECONNECT;
	NET_sendInputMessage(&mes);
}

void printCurrentDateTime(){
	struct tm dt;
	
	if(isNeedSetTime){
		dt.tm_mday = 11;
		dt.tm_mon = 7;
		dt.tm_year = 2018;
	
		dt.tm_hour = 15;
		dt.tm_min = 41;
		dt.tm_sec = 39;
	
		setCurrentTime(&dt);
		
		isNeedSetTime = false;
	}
	else{
		getCurrentTime(&dt);
		printf("DateTime: %.2d.%.2d.%.4d %.2d:%.2d:%.2d\n", dt.tm_mday, dt.tm_mon, dt.tm_year, dt.tm_hour, dt.tm_min, dt.tm_sec);
	}
}

void updateMeterValues(void){
	int i;
	ChargePointConnector *conn;
	
	for(i = 0; i < CONFIGURATION_NUMBER_OF_CONNECTORS; i++){
			conn = &connector[i];
			if(conn->status == CHARGE_POINT_STATUS_CHARGING){
				conn->isMeterValueRequest = true;
			}
	}
}

void mainDispatcher(void){
	uint32_t currentTick, lastLedTick;
	uint32_t lastSendTick, lastMeterReqTick;
	char sendData[16];
	GeneralMessage message;
	uint32_t btnPressCnt = 0;
	
	ChargePoint_init();
	
	Settings_init();
	settings = Settings_get();
	printf("ChargePointID: %s\n", settings->ChargePointId);
	
	fillOcppConfigurationWithDefValues(&ocppConfVaried, &ocppConfFixed, &ocppConfRestrict);
	
	
	
	initDisplay();
	initConnectors();
	checkHardware();
	
	Display_clear();
	Indication_Init(connector);
	
	if(ChargePoint_getStatusState() != CHARGE_POINT_STATUS_FAULTED){
		ChargePoint_setStatusState(CHARGE_POINT_STATUS_AVAILABLE, 0, NULL);
	}
	
